---
kind: method
id: M:Autodesk.Revit.DB.ReferencePointArray.#ctor
source: html/8408999a-c2c5-df0c-fcd6-ead91255669c.htm
---
# Autodesk.Revit.DB.ReferencePointArray.#ctor Method

Initializes a new instance of the ReferencePointArray class

## Syntax (C#)
```csharp
public ReferencePointArray()
```